Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_features (DenseFeature multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  13312     
_________________________________________________________________
dropout (Dropout)            multiple                  0         
_________________________________________________________________
dense_1 (Dense)              multiple                  262656    
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
_________________________________________________________________
dense_2 (Dense)              multiple                  131328    
_________________________________________________________________
dropout_2 (Dropout)          multiple                  0         
_________________________________________________________________
dense_3 (Dense)              multiple                  32896     
_________________________________________________________________
dropout_3 (Dropout)          multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  16512     
_________________________________________________________________
dropout_4 (Dropout)          multiple                  0         
_________________________________________________________________
dense_5 (Dense)              multiple                  8256      
_________________________________________________________________
dropout_5 (Dropout)          multiple                  0         
_________________________________________________________________
Output (Dense)               multiple                  65        
=================================================================
Total params: 465,025
Trainable params: 465,025
Non-trainable params: 0
_________________________________________________________________
